===================================================
0
===================================================
second(timestampltz '00:00:00 01/01')    
0     

===================================================
second(timestampltz '03:14:07 1/19/2038')    
7     

===================================================
second(timestampltz '0:0:0 PM 1970-01-01')    
0     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
second(datetimeltz '0:0:0.00 1/1')    
0     

===================================================
Error:-494
===================================================
0
