===================================================
round(date '1999-12-20', 'dd')    
1999-12-20     

===================================================
Error:-494
===================================================
round(date '1999-12-20', 'yyyy')    
2000-01-01     

===================================================
round(date '1999-12-20', 'yy')    
2000-01-01     

===================================================
round(date '12/20/1999', 'q')    
2000-01-01     

===================================================
round(date '1999-12-20', 'mm')    
2000-01-01     

===================================================
round(date '1999-12-20', 'month')    
2000-01-01     

===================================================
round(date '1999-12-20', 'mon')    
2000-01-01     

===================================================
round(date '1999-12-20', 'dd')    
1999-12-20     

===================================================
round(date '1999-12-20', 'day')    
1999-12-19     

===================================================
round(date '1999-12-20', 'dy')    
1999-12-19     

===================================================
round(date '1999-12-20', 'd')    
1999-12-19     

===================================================
round(date '1999-12-20', 'hh')    
1999-12-20     

===================================================
round(date '1999-12-20', 'hh12')    
1999-12-20     

===================================================
round(date '1999-12-20', 'mi')    
1999-12-20     

===================================================
round(date '1999-12-20', 'ss')    
1999-12-20     

===================================================
round(date '1999-12-20', 'ff')    
1999-12-20     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
0
===================================================
1
===================================================
1
===================================================
round(col1, 'yyyy')    round(col2, 'yyyy')    
2020-01-01     2020-01-01     
1755-01-01     1755-01-01     

===================================================
round(col1, 'yy')    round(col2, 'yy')    
2020-01-01     2020-01-01     
1755-01-01     1755-01-01     

===================================================
round(col1, 'q')    round(col2, 'q')    
2020-04-01     2020-04-01     
1754-10-01     1754-10-01     

===================================================
round(col1, 'mm')    round(col2, 'mm')    
2020-05-01     2020-05-01     
1754-11-01     1754-11-01     

===================================================
round(col1, 'month')    round(col2, 'month')    
2020-05-01     2020-05-01     
1754-11-01     1754-11-01     

===================================================
round(col1, 'mon')    round(col2, 'mon')    
2020-05-01     2020-05-01     
1754-11-01     1754-11-01     

===================================================
round(col1, 'dd')    round(col2, 'dd')    
2020-05-13     2020-05-13     
1754-11-05     1754-11-05     

===================================================
round(col1, 'day')    round(col2, 'day')    
2020-05-10     2020-05-10     
1754-11-03     1754-11-03     

===================================================
round(col1, 'dy')    round(col2, 'dy')    
2020-05-10     2020-05-10     
1754-11-03     1754-11-03     

===================================================
round(col1, 'd')    round(col2, 'd')    
2020-05-10     2020-05-10     
1754-11-03     1754-11-03     

===================================================
round(col1, 'hh')    round(col2, 'hh')    
2020-05-13     2020-05-13     
1754-11-05     1754-11-05     

===================================================
round(col1, 'hh12')    round(col2, 'hh24')    
2020-05-13     2020-05-13     
1754-11-05     1754-11-05     

===================================================
round(col1, 'mi')    round(col2, 'mi')    
2020-05-13     2020-05-13     
1754-11-05     1754-11-05     

===================================================
round(col1, 'ss')    round(col2, 'ss')    
2020-05-13     2020-05-13     
1754-11-05     1754-11-05     

===================================================
round(col1, 'ff')    round(col2, 'ff')    
2020-05-13     2020-05-13     
1754-11-05     1754-11-05     

===================================================
0
