===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
coercibility(a)    coercibility( concat(a, a))    coercibility(a||a)    
2     5     5     

===================================================
0
===================================================
0
===================================================
coercibility(s)    coercibility( concat(s, s))    coercibility(s||s)    
3     6     6     

===================================================
0
===================================================
coercibility(s2)    coercibility( concat(s2, s2))    coercibility(s2||s2)    
3     6     6     

===================================================
coercibility( concat(a, s))    coercibility(a||s)    
5     5     

===================================================
0
===================================================
0
===================================================
0
