===================================================
0
===================================================
0
===================================================
coercibility(_binary'a')    
0     

===================================================
coercibility(_binary'')    
0     

===================================================
0
===================================================
1
===================================================
coercibility(s collate binary)    
0     

===================================================
0
===================================================
0
===================================================
1
===================================================
coercibility(s1||s2)    
5     

===================================================
coercibility( user() )    coercibility( database())    coercibility( schema())    coercibility( version())    
7     7     7     7     

===================================================
0
===================================================
coercibility(@a)    
11     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
