===================================================
0
===================================================
time_to_sec(timestampltz '00:00:00 01/01')    
0     

===================================================
time_to_sec(timestampltz '03:14:07 1/19/2038')    
11647     

===================================================
time_to_sec(timestampltz '0:0:0 PM 1970-01-01')    
43200     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
time_to_sec(datetimeltz '0:0:0.00 1/1')    
0     

===================================================
Error:-494
===================================================
0
