===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
ceil(test_numeric)    
null     
0E-10     
1.0000000000     
2.0000000000     
3.0000000000     
4.0000000000     
4.0000000000     
9.0000000000     
880215.0000000000     
1940081.0000000000     
2090403.0000000000     
3882147.0000000000     
3928300.0000000000     

===================================================
0
