===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
a    b    
A     1     
B     2     

===================================================
json_object(a, b)    
{"A":1}     
{"B":2}     

===================================================
json_object(a, b)    
{"A":1}     
{"B":2}     

===================================================
json_object(a, b)    
{"A":1}     
{"B":2}     

===================================================
0
===================================================
json_object(a, b)    
{"A":1}     
{"B":2}     
{"{\"A\":1}":{"A":1}}     
{"{\"B\":2}":{"B":2}}     

===================================================
0
