===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
json_pretty(a)    
{
  "Person": {
    "Name": "Homer",
    "Age": 39,
    "Hobbies": [
      "Eating",
      "Sleeping"
    ]
  }
}     

===================================================
json_length( json_extract(a, '$.Person'))    
3     

===================================================
json_length( json_extract(a, '$.Person.Name'))    
1     

===================================================
json_length( json_extract(a, '$.Person.Hobbies'))    
2     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
c    json_extract(c, '$.id')    i    
{"id":"3","name":"Barney"}     "3"     3     
{"id":"4","name":"Betty"}     "4"     4     
{"id":"2","name":"Wilma"}     "2"     2     

===================================================
json_extract(c, '$.name')    
"Barney"     
"Betty"     
"Wilma"     

===================================================
json_unquote( json_extract(c, '$.name'))    
Barney     
Betty     
Wilma     

===================================================
json_unquote( json_extract(c, '$.name'))    
Barney     
Betty     
Wilma     

===================================================
1
===================================================
c    json_extract(c, '$.id')    i    
{"id":"3","name":"Barney"}     "3"     3     

===================================================
2
===================================================
c    json_extract(c, '$[4]')    
[3,10,"x",17,44]     44     
[3,10,5,17,[22,44,"y"]]     [22,44,"y"]     
{"id":"2","name":"Wilma"}     null     
{"id":"3","name":"Barney"}     null     

===================================================
i    c    
30     [3,10,5,17,[22,44,"y"]]     
33     [3,10,"x",17,44]     

===================================================
i    c    
30     [3,10,5,17,[22,44,"y"]]     

===================================================
c    json_extract(c, '$[4][1]')    
[3,10,"x",17,44]     null     
[3,10,5,17,[22,44,"y"]]     44     
{"id":"2","name":"Wilma"}     null     
{"id":"3","name":"Barney"}     null     

===================================================
i    json_unquote( json_extract(c, '$[2]'))    
30     5     
33     x     

===================================================
i    json_unquote( json_extract(c, '$[2]'))    
30     5     
33     x     

===================================================
i    json_unquote( json_extract(c, '$[2]'))    
30     5     
33     x     

===================================================
i    json_unquote( json_extract(c, '$[4][2]'))    
30     y     
33     null     

===================================================
i    json_unquote( json_extract(c, '$[4][2]'))    
30     y     
33     null     

===================================================
i    json_unquote( json_extract(c, '$[4][2]'))    
30     y     
33     null     

===================================================
0
