===================================================
rowid    ac    aj    bx    
1     3     "3"     0     
2     2     2     0     
3     111     {"x":333}     1     
4     0     0     0     
5     [1,2]     [1,2]     0     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
id    ac    aj    
1     3     "3"     
2     2     2     
3     null     null     
4     0     0     
5     [1,2]     [1,2]     

===================================================
0
===================================================
0
===================================================
xval    yval    
2     8     
3     7     
4     6     

===================================================
xval    yval    
3     7     

===================================================
a    b    
1     11     
1     111     
2     22     
2     222     

===================================================
a    b1    b2    
1     11     null     
1     111     null     
1     null     11     
1     null     111     
2     22     null     
2     222     null     
2     null     22     
2     null     222     

===================================================
top_ord    apath    bpath    ord    lpath    
1     a_val     c_val     1     1     
1     a_val     c_val     1     2     
2     a_val     c_val     1     11     
2     a_val     c_val     2     22     

