===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
id||level    parentid    text    level-2    
11     null     A     -1     
21     null     B     -1     
32     1     AA     0     
42     1     AB     0     
52     2     BA     0     
62     2     BB     0     

===================================================
0
===================================================
0
===================================================
concat(id, level)    parentid    text    level-2    
11     null     A     -1     
21     null     B     -1     
32     1     AA     0     
42     1     AB     0     
52     2     BA     0     
62     2     BB     0     

===================================================
0
===================================================
0
===================================================
id    parentid    text    to_char(level)+'000'    
3     1     AA     2000     
4     1     AB     2000     
5     2     BA     2000     
6     2     BB     2000     

===================================================
id    parentid    text    to_char(level)    

===================================================
id    id    

===================================================
0
===================================================
0
