===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
id    cast(ts as date)    
1     2019-01-02     
2     2019-01-02     
3     2019-01-02     
4     2019-01-02     

===================================================
id    cast(ts as time)    
1     12:00:01     
2     22:00:01     
3     04:00:01     
4     03:00:01     

===================================================
id    cast(ts as datetime)    
1     2019-01-02 12:00:01.999     
2     2019-01-02 22:00:01.999     
3     2019-01-02 04:00:01.999     
4     2019-01-02 03:00:01.999     

===================================================
id    cast(ts as datetime)    
1     2019-01-02 12:00:01.999     
2     2019-01-02 22:00:01.999     
3     2019-01-02 04:00:01.999     
4     2019-01-02 03:00:01.999     

===================================================
id    cast(dtltz as date)    
1     2019-01-02     
2     2019-01-02     
3     2019-01-02     
4     2019-01-02     

===================================================
id    cast(dtltz as time)    
1     12:00:01     
2     22:00:01     
3     04:00:01     
4     03:00:01     

===================================================
id    cast(dtltz as datetime)    
1     2019-01-02 12:00:01.999     
2     2019-01-02 22:00:01.999     
3     2019-01-02 04:00:01.999     
4     2019-01-02 03:00:01.999     

===================================================
id    cast(dtltz as datetime)    
1     2019-01-02 12:00:01.999     
2     2019-01-02 22:00:01.999     
3     2019-01-02 04:00:01.999     
4     2019-01-02 03:00:01.999     

===================================================
id    cast(dttz as date)    
1     2019-01-02     
2     2019-01-02     
3     2019-01-02     
4     2019-01-02     

===================================================
id    cast(dttz as time)    
1     12:00:01     
2     12:00:01     
3     12:00:01     
4     12:00:01     

===================================================
id    cast(dttz as datetime)    
1     2019-01-02 12:00:01.999     
2     2019-01-02 12:00:01.999     
3     2019-01-02 12:00:01.999     
4     2019-01-02 12:00:01.999     

===================================================
id    cast(dttz as datetime)    
1     2019-01-02 12:00:01.999     
2     2019-01-02 12:00:01.999     
3     2019-01-02 12:00:01.999     
4     2019-01-02 12:00:01.999     

===================================================
0
===================================================
0
