===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
moneytest    
null     
0.0     
9876.1     

===================================================
cast(moneytest as varchar)    
null     
$0     
$9876.1     

===================================================
cast(moneytest as varchar(10))    
null     
$0     
$9876.1     

===================================================
cast(moneytest as varchar(20))    
null     
$0     
$9876.1     

===================================================
cast(moneytest as smallint)    
null     
0     
9876     

===================================================
cast(moneytest as integer)    
null     
0     
9876     

===================================================
cast(moneytest as numeric(38,10))    
null     
0E-10     
9876.1000000000     

===================================================
cast(moneytest as float)    
null     
0.0     
9876.1     

===================================================
cast(moneytest as double)    
null     
0.0     
9876.1     

===================================================
cast(moneytest as monetary)    
null     
0.0     
9876.1     

===================================================
cast(moneytest as char(8))    
null     
$0           
$9876.1      

===================================================
cast(moneytest as nchar(20))    
null     
$0                       
$9876.1                  

===================================================
cast(moneytest as nchar varying(20))    
null     
$0     
$9876.1     

===================================================
cast(set{moneytest} as set(numeric(38,10)))    
null,     
0E-10,     
9876.1000000000,     

===================================================
cast(multiset{moneytest} as multiset(numeric(38,10)))    
null,     
0E-10,     
9876.1000000000,     

===================================================
cast({moneytest} as sequence(numeric(38,0)))    
null,     
0,     
9876,     

===================================================
0
===================================================
0
