===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
3
===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    
4     ddd                                                    ddd     8000     e0     ddd                                                    ddd     dddddddddd     2007-01-01 09:00:00.0     
5     eee                                                    eee     a000     f0     eee                                                    eee     eeeeeeeeee     2007-01-01 09:00:00.0     
6     fff                                                    fff     a000     f0     fff                                                    eee     ffffffffff     2007-01-01 09:00:00.0     

===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    

===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    
4     ddd                                                    ddd     8000     e0     ddd                                                    ddd     dddddddddd     2007-01-01 09:00:00.0     
5     eee                                                    eee     a000     f0     eee                                                    eee     eeeeeeeeee     2007-01-01 09:00:00.0     
6     fff                                                    fff     a000     f0     fff                                                    eee     ffffffffff     2007-01-01 09:00:00.0     

===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    

===================================================
0
===================================================
0
