===================================================
0
===================================================
1
===================================================
i    
123     

===================================================
0
===================================================
mod('123', '2')    
1.0     

===================================================
(date '2010-01-01'<datetime '2010-02-02 12:00:00 am')    
1     

===================================================
(datetime '2010-01-01'<'2010-02-02')    
1     

===================================================
(5.2='5.2')    
1     

===================================================
date '2002-01-01'-datetime '2001-02-02 12:00:00 am'    
28771200000     

===================================================
date '2002-01-01'+'10'    
2002-01-11     

===================================================
date '2002-01-01'-'2001-01-01'    
31536000000     

===================================================
Error:-494
===================================================
4+'5.2'    
9.2     

===================================================
Error:-494
===================================================
'3'*'2'    
6.0     

===================================================
0
===================================================
'1'+'1'    
11     

===================================================
0
===================================================
'1'+'1'    
2.0     

===================================================
0
===================================================
0
