===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
a    to_date(a)    b    to_date(b)    c    to_date(c)    
01/01/2999     2999-01-01     01/01/2999     2999-01-01     01/01/2999     2999-01-01     

===================================================
a    to_date(a, 'YYYY MM DD')    to_date(a, 'yyyy mm dd')    
19870101     1987-01-01     1987-01-01     
20001212     2000-12-12     2000-12-12     
29991231     2999-12-31     2999-12-31     

===================================================
a    to_date(a, 'YYYYMMDD')    to_date(a, 'yyyymmdd')    
19870101     1987-01-01     1987-01-01     
20001212     2000-12-12     2000-12-12     
29991231     2999-12-31     2999-12-31     

===================================================
b    to_date(b, 'YYYY MM DD')    to_date(b, 'yyyy mm dd')    
19870101       1987-01-01     1987-01-01     
20001212       2000-12-12     2000-12-12     
29991231       2999-12-31     2999-12-31     

===================================================
b    to_date(b, 'YYYYMMDD')    to_date(b, 'yyyymmdd')    
19870101       1987-01-01     1987-01-01     
20001212       2000-12-12     2000-12-12     
29991231       2999-12-31     2999-12-31     

===================================================
c    to_date(c, 'YYYY MM DD')    to_date(c, 'yyyy mm dd')    
19870101     1987-01-01     1987-01-01     
20001212     2000-12-12     2000-12-12     
29991231     2999-12-31     2999-12-31     

===================================================
c    to_date(c, 'YYYYMMDD')    to_date(c, 'yyyymmdd')    
19870101     1987-01-01     1987-01-01     
20001212     2000-12-12     2000-12-12     
29991231     2999-12-31     2999-12-31     

===================================================
c    to_date(c, 'YYYYMMDD')    to_date(c, 'yyyymmdd')    
null     null     null     

===================================================
to_date(null, null)    
null     
null     
null     
null     
null     
null     
null     
null     
null     

===================================================
to_date(' 10000101', ' yyyymmdd')    
1000-01-01     
1000-01-01     
1000-01-01     
1000-01-01     
1000-01-01     
1000-01-01     
1000-01-01     
1000-01-01     
1000-01-01     

===================================================
c    to_date(a, 'yyyyddmm')    
11111111     1111-11-11     

===================================================
c    to_date(a, 'ddmmyyyy')    
11111111     1111-11-11     

===================================================
to_date(null)    
null     
null     
null     
null     
null     
null     
null     
null     
null     

===================================================
0
