===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
0
===================================================
0
===================================================
    
follow     

===================================================
    
nl-join     

===================================================
    
m-join     

===================================================
fn    fb.bn    
30     null     
10     1     
20     2     

===================================================
fn    fb.bn    zn    
30     null     200     
30     null     null     
10     1     200     
10     1     null     
20     2     200     
20     2     null     

===================================================
fn    fb.bn    zn    
30     null     200     
30     null     null     

===================================================
fn    fb.bn    zn    
30     null     200     
30     null     null     
10     1     null     
20     2     null     

===================================================
0
===================================================
0
===================================================
0
