===================================================
    
null     

===================================================
0
===================================================
1
===================================================
1
===================================================
2
===================================================
4
===================================================
8
===================================================
16
===================================================
32
===================================================
64
===================================================
0
===================================================
set((select a from foo))    
1,2,     

===================================================
0
===================================================
a    
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
2     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     
1     

===================================================
0
===================================================
    
null     

===================================================
    
null     

===================================================
0
===================================================
0
