===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
Error:-631
===================================================
3
===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    
4     fff                                                    fff     a000     f0     fff                                                    fff     ffffffffff     2006-03-01 09:00:00.0     
5     ggg                                                    ggg     a000     f0     ggg                                                    ggg     gggggggggg     2006-03-01 09:00:00.0     
6     hhh                                                    hhh     a000     f0     hhh                                                    hhh     hhhhhhhhhh     2006-03-01 09:00:00.0     

===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    

===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    
4     fff                                                    fff     a000     f0     fff                                                    fff     ffffffffff     2006-03-01 09:00:00.0     
5     ggg                                                    ggg     a000     f0     ggg                                                    ggg     gggggggggg     2006-03-01 09:00:00.0     
6     hhh                                                    hhh     a000     f0     hhh                                                    hhh     hhhhhhhhhh     2006-03-01 09:00:00.0     

===================================================
id    test_char    test_varchar    test_bit    test_varbit    test_nchar    test_nvarchar    test_string    test_datetime    

===================================================
0
===================================================
0
