===================================================
least(datetime '01/01/2000', datetime '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least(datetime '01/01/2000', timestamp '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least(datetime '01/01/2000', date '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
Error:-494
===================================================
least(datetime '01/01/2000', '01/02/2000 00:00:00.000')    
2000-01-01 00:00:00.0     

===================================================
least(datetime '01/01/2000', '01/02/2000 00:00:00')    
2000-01-01 00:00:00.0     

===================================================
least(datetime '01/01/2000', '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
Error:-494
===================================================
least(timestamp '01/01/2000', datetime '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least(timestamp '01/01/2000', timestamp '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least(timestamp '01/01/2000', date '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
Error:-494
===================================================
least(timestamp '01/01/2000', '01/02/2000 00:00:00.000')    
2000-01-01 00:00:00.0     

===================================================
least(timestamp '01/01/2000', '01/02/2000 00:00:00')    
2000-01-01 00:00:00.0     

===================================================
least(timestamp '01/01/2000', '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
Error:-494
===================================================
least(date '01/01/2000', datetime '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least(date '01/01/2000', timestamp '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least(date '01/01/2000', date '01/02/2000')    
2000-01-01     

===================================================
Error:-494
===================================================
least(date '01/01/2000', '01/02/2000 00:00:00.000')    
2000-01-01     

===================================================
least(date '01/01/2000', '01/02/2000 00:00:00')    
2000-01-01     

===================================================
least(date '01/01/2000', '01/02/2000')    
2000-01-01     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
least(time '00:00:00', time '00:00:00')    
00:00:00     

===================================================
least(time '00:00:00', '01/02/2000 00:00:00.000')    
00:00:00     

===================================================
least(time '00:00:00', '01/02/2000 00:00:00')    
00:00:00     

===================================================
Error:-494
===================================================
least(time '00:00:00', '00:00:01')    
00:00:00     

===================================================
least('01/01/2000 00:00:00.000', datetime '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least('01/01/2000 00:00:00.000', timestamp '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least('01/01/2000 00:00:00.000', date '01/02/2000')    
2000-01-01     

===================================================
least('01/01/2000 00:00:00.000', time '00:00:00')    
00:00:00     

===================================================
least('01/01/2000 00:00:00.000', '01/02/2000 00:00:00.000')    
01/01/2000 00:00:00.000     

===================================================
least('01/01/2000 00:00:00.000', '01/02/2000 00:00:00')    
01/01/2000 00:00:00.000     

===================================================
least('01/01/2000 00:00:00.000', '01/02/2000')    
01/01/2000 00:00:00.000     

===================================================
least('01/01/2000 00:00:00.000', '00:00:00')    
00:00:00     

===================================================
least('01/01/2000 00:00:00', datetime '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least('01/01/2000 00:00:00', timestamp '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least('01/01/2000 00:00:00', date '01/02/2000')    
2000-01-01     

===================================================
least('01/01/2000 00:00:00', time '00:00:00')    
00:00:00     

===================================================
least('01/01/2000 00:00:00', '01/02/2000 00:00:00.000')    
01/01/2000 00:00:00     

===================================================
least('01/01/2000 00:00:00', '01/02/2000 00:00:00')    
01/01/2000 00:00:00     

===================================================
least('01/01/2000 00:00:00', '01/02/2000')    
01/01/2000 00:00:00     

===================================================
least('01/01/2000 00:00:00', '00:00:00')    
00:00:00     

===================================================
least('01/01/2000', datetime '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least('01/01/2000', timestamp '01/02/2000')    
2000-01-01 00:00:00.0     

===================================================
least('01/01/2000', date '01/02/2000')    
2000-01-01     

===================================================
Error:-494
===================================================
least('01/01/2000', '01/02/2000 00:00:00.000')    
01/01/2000     

===================================================
least('01/01/2000', '01/02/2000 00:00:00')    
01/01/2000     

===================================================
least('01/01/2000', '01/02/2000')    
01/01/2000     

===================================================
least('01/01/2000', '00:00:00')    
00:00:00     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
least('00:00:00', time '00:00:00')    
00:00:00     

===================================================
least('00:00:00', '01/02/2000 00:00:00.000')    
00:00:00     

===================================================
least('00:00:00', '01/02/2000 00:00:00')    
00:00:00     

===================================================
least('00:00:00', '01/02/2000')    
00:00:00     

===================================================
least('00:00:00', '00:00:01')    
00:00:00     

