===================================================
trunc(1.223, 1)    
1.200     

===================================================
trunc('1.223', 1)    
1.2     

===================================================
Error:-494
===================================================
trunc(null, 1)    
null     

===================================================
trunc(1.223, '1')    
1.200     

===================================================
trunc('1.223', '1')    
1.2     

===================================================
Error:-494
===================================================
trunc(null, '1')    
null     

===================================================
Error:-494
===================================================
Error:-494
===================================================
Error:-494
===================================================
trunc(null, 'a')    
null     

===================================================
trunc(1.223, null)    
null     

===================================================
trunc('1.223', null)    
null     

===================================================
trunc('a', null)    
null     

===================================================
trunc(null, null)    
null     

===================================================
trunc(12345678903532535312345.12345, 3)    
12345678903532535312345.12300     

