===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
trunc(test_numeric, test_smallint)    
null     
0E-10     
1.0000000000     
1.2300000000     
2.2770000000     
3.4736400000     
3.5520000000     
8.1466520000     
880214.1466520000     
1940080.2300000000     
2090402.2770000000     
3882146.4736400000     
3928299.5520000000     

===================================================
trunc(test_numeric, test_int)    
null     
0E-10     
1.0000000000     
1.2000000000     
2.2700000000     
3.4736000000     
3.5520000000     
8.1466500000     
880214.1466500000     
1940080.2000000000     
2090402.2700000000     
3882146.4736000000     
3928299.5520000000     

===================================================
0
