===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
datetest    
null     
null     
1977-08-14     

===================================================
cast(datetest as varchar)    
null     
null     
08/14/1977     

===================================================
cast(datetest as varchar(10))    
null     
null     
08/14/1977     

===================================================
cast(datetest as varchar(20))    
null     
null     
08/14/1977     

===================================================
cast(datetest as date)    
null     
null     
1977-08-14     

===================================================
cast(datetest as timestampltz)    
null     
null     
1977-08-14 00:00:00.0 +09:00     

===================================================
cast(datetest as nchar(20))    
null     
null     
08/14/1977               

===================================================
cast(datetest as nchar varying(20))    
null     
null     
08/14/1977     

===================================================
cast(set{datetest} as set(date))    
null,     
null,     
1977-08-14,     

===================================================
cast(multiset{datetest} as multiset(date))    
null,     
null,     
1977-08-14,     

===================================================
cast({datetest} as sequence(date))    
null,     
null,     
1977-08-14,     

===================================================
0
===================================================
0
===================================================
0
