===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
cast(doublepretest as timestampltz)    
null     
0000-00-00 00:00:00.000 +09:00     
1970-01-12 19:20:54.000 +09:00     

===================================================
0
===================================================
0
===================================================
0
