===================================================
0
===================================================
0
===================================================
1
===================================================
0
===================================================
1
===================================================
0
===================================================
1
===================================================
0
===================================================
1
===================================================
0
===================================================
1
===================================================
0
===================================================
1
===================================================
ts    ts_tz    ts_ltz    round(ts, 'yyyy')    round(ts_tz, 'yyyy')    round(ts_ltz, 'yyyy')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-01-01     1996-01-01     1996-01-01     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'yyyy')    round(dt_tz, 'yyyy')    round(dt_ltz, 'yyyy')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-01-01     1996-01-01     1996-01-01     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'yy')    round(ts_tz, 'yy')    round(ts_ltz, 'yy')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-01-01     1996-01-01     1996-01-01     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'yy')    round(dt_tz, 'yy')    round(dt_ltz, 'yy')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-01-01     1996-01-01     1996-01-01     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'mm')    round(ts_tz, 'mm')    round(ts_ltz, 'mm')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-01     1996-02-01     1996-02-01     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'mm')    round(dt_tz, 'mm')    round(dt_ltz, 'mm')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-01     1996-02-01     1996-02-01     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'q')    round(ts_tz, 'q')    round(ts_ltz, 'q')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-01-01     1996-01-01     1996-01-01     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'q')    round(dt_tz, 'q')    round(dt_ltz, 'q')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-01-01     1996-01-01     1996-01-01     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'day')    round(ts_tz, 'day')    round(ts_ltz, 'day')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-04     1996-02-04     1996-02-04     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'day')    round(dt_tz, 'day')    round(dt_ltz, 'day')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-04     1996-02-04     1996-02-04     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'dd')    round(ts_tz, 'dd')    round(ts_ltz, 'dd')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-04     1996-02-03     1996-02-04     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'dd')    round(dt_tz, 'dd')    round(dt_ltz, 'dd')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-04     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'hh')    round(ts_tz, 'hh')    round(ts_ltz, 'hh')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-03     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'hh')    round(dt_tz, 'hh')    round(dt_ltz, 'hh')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-03     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'mi')    round(ts_tz, 'mi')    round(ts_ltz, 'mi')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-03     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'mi')    round(dt_tz, 'mi')    round(dt_ltz, 'mi')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-03     

===================================================
ts    ts_tz    ts_ltz    round(ts, 'ss')    round(ts_tz, 'ss')    round(ts_ltz, 'ss')    
1996-02-03 16:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-03     

===================================================
dt    dt_tz    dt_ltz    round(dt, 'ss')    round(dt_tz, 'ss')    round(dt_ltz, 'ss')    
1996-02-03 02:03:04.0     1996-02-03 02:03:04.0 America/Lima -05     1996-02-03 16:03:04.0 Asia/Seoul KST     1996-02-03     1996-02-03     1996-02-03     

===================================================
0
