===================================================
timediff('11:59:59 pm', '1:1:1')    
22:58:58     

===================================================
timediff('1:1:2', '1:1:1')    
00:00:01     

===================================================
Error:-494
===================================================
timediff('2011-03-17', '03/17/2011')    
00:00:00     

===================================================
Error:-494
===================================================
Error:-494
===================================================
timediff('1999-10-10 18:14:45', '1999-10-10 6:14:45')    
12:00:00     

===================================================
Error:-494
===================================================
Error:-494
===================================================
timediff('1999-10-10 18:14:45.999', '1999-10-10 6:14:45.888')    
12:00:00     

===================================================
Error:-494
===================================================
Error:-494
