===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
numerictest    
null     
0E-10     
9876543210987654321012345678.0123456789     

===================================================
cast(numerictest as varchar collate iso88591_bin_ts)    
null     
0.0000000000     
9876543210987654321012345678.0123456789     

===================================================
cast(numerictest as varchar(39) collate iso88591_bin_ts)    
null     
0.0000000000     
9876543210987654321012345678.0123456789     

===================================================
cast(numerictest as numeric(38,10))    
null     
0E-10     
9876543210987654321012345678.0123456789     

===================================================
cast(numerictest as float)    
null     
0.0     
9.876543E27     

===================================================
cast(numerictest as double)    
null     
0.0     
9.876543210987654E27     

===================================================
cast(numerictest as monetary)    
null     
0.0     
9.876543210987654E27     

===================================================
cast(set{numerictest} as set(numeric(38,10)))    
null,     
0E-10,     
9876543210987654321012345678.0123456789,     

===================================================
cast(multiset{numerictest} as multiset(numeric(38,10)))    
null,     
0E-10,     
9876543210987654321012345678.0123456789,     

===================================================
cast({numerictest} as sequence(numeric(38,0)))    
null,     
0,     
9876543210987654321012345678,     

===================================================
cast(0.123456 as numeric(5,5))    
0.12346     

===================================================
cast(0.12345 as numeric(4,4))    
0.1235     

===================================================
cast(0.1234 as numeric(3,3))    
0.123     

===================================================
Error:-427
===================================================
0
===================================================
0
